<?php $title = "初投稿。"; ?>
<?php $description = "説明文"; ?>
<?php include("../_inc/header.php"); ?>
<div class="contents">
    <div class="Tips_contents">
        <h2>ようやく形に...</h2>
        <p>以前からサイト構築に興味自体はあったのですが<br>
            如何せんhtml,cssの勉強をするのが億劫で触れておらず。<br>
            しかしHALに入学したことでようやく重い腰をあげてコーディングに入りました。<br>
            実際授業や課題等で演習していることもあり、また足りない分は個人で補うことでなんとか土台の完成（？）まで漕ぎ着けることができたのですが、、、、<br>
            <strong>俺が求めてたのってこんなのだっけ？</strong>
            <br>
            と。<br>
            いやお恥ずかしい話もっと一気に完成型まで作り上げる予定だったのですが思いのほか体力と時間持っていかれちゃって、、、^^;<br>
            おかげ様で課題と当サイトの制作に板挟みされている状態です（）
            しかしやっぱり自分で調べて何かを作るって本当に楽しいですね〜！<br>
            現状当サイトにはまだまだ課題が残っていて、修正・更新には長い時間がかかりそうです。。<br>
            <ul>
                <li>DBを使用し、投稿記事を複数作成せずに書き換えを行う手法を実装</li>
                <li>JavaScriptでアニメーションの実装</li>
            </ul>
            などなど。。。<br>
            現状のままだと<s>(わざわざ投稿ごとにファイルを作るので面倒で更新が止まりそう)</s>色々と大変なので（ ;  ; ）<br>
            在学中は随時更新しつつサイトもパワーアップさせていく予定ではあるので精一杯がんばります：）
        </p>
    </div>
</div>
<?php include("../_inc/footer.php"); ?>